examples/0D-case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pbeFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

maxDeltaT       1;

adjustTimeStep  off;        // Currently not available

writeControl    runTime;

writeInterval   200;

purgeWrite      0;

writeFormat     binary;     // Use binary to avoid corruption of moments

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

suppressSolverInfo yes;

maxCo           0.5;

maxDeltaT       0.1;

functions
{
    probes
    {
        // Where to load it from
        libs            (libsampling);

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl   timeStep;
        writeInterval  1;

        // Fields to be probed
        fields
        (
            moment.0.populationBalance
            moment.1.populationBalance
            moment.2.populationBalance
            moment.3.populationBalance
            moment.4.populationBalance
            moment.5.populationBalance
            C
            T
        );

        probeLocations
        (
            ( 0.5 0.5 0.5 )
        );
    }
}

libs
(
    "libcrystalGrowthModels.so"
);

// ************************************************************************* //
