examples/0D-case/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant";
    object      populationBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel univariate;

univariateCoeffs
{
    aggregation     off;
    aggregationKernel
    {
        aggregationKernel hydrodynamic;
        Ca              Ca [ 0 0 -1 0 0 0 0 ] 1;
    }
    breakup         off;
    breakupKernel
    {
        breakupKernel   exponential;
        expCoeff        expCoeff [ 0 -3 0 0 0 0 0 ] 0.01;
        Cb              Cb [ 0 0 -1 0 0 0 0 ] 0.1;
        daughterDistribution
        {
            daughterDistribution symmetricFragmentation;
        }
    }
    diffusionModel
    {
        diffusionModel  none;
    }
    growth          on;
    growthModel
    {
        growthModel     solution;
        minAbscissa     0;
        maxAbscissa     1e+15;
        kG              kG [ 0 1 -1 0 0 0 0 ] 1e-8;
        g               0;
        Eg              Eg [ 1 2 -2 0 -1 0 0 ] 0;
        R               R [ 1 2 -2 -1 -1 0 0 ] 8.314;
        alphaG          alphaG [ 0 -1 0 0 0 0 0 ] 0;
        Lg              0;
        Csat0           Csat0 [ 1 -3 0 0 0 0 0 ] 30;
        dCsatdT         dCsatdT [ 1 -3 0 -1 0 0 0 ] 0.2;
        Tref            Tref [ 0 0 0 1 0 0 0 ] 298.15;
    }
    nucleation      off;
    nucleationModel
    {
        nucleationModel none;
    }
    odeCoeffs
    {
        ATol            1e-08;
        RTol            0.0001;
        fac             0.9;
        facMin          0.5;
        facMax          2;
        minLocalDt      1e-05;
    }
}


// ************************************************************************* //
